"""
ДОРАБОТАТЬ
"""
#=======================================================================================================================
"""
1. Переименовать все Request Pydantic Schemas:
Пример: CreateCoursesRequestSchem -> CreateCourseSchema

По Response Pydantic Schemas - оставить CreateCoursesResponseSchema

------------------------------------------------------------------------------------------------------------------------
2. Создать файл base_data.py c Base_URL, timeout ...

------------------------------------------------------------------------------------------------------------------------
3. Переименовать параметры <request> в актуальные:
def create_user_api(self, request: CreateUserRequestSchema) -> Response:
                              ⬇︎
def create_user_api(self, create_user_payload: CreateUserRequestSchema) -> Response:
------------------------------------------------------------------------------------------------------------------------
4. Попробывать прописать а главном api_client - json=json.model_dump(by_alias=True), чтоб убрать из методов клиентов

------------------------------------------------------------------------------------------------------------------------
5. 
BASE Schema c config

from pydantic import BaseModel, ConfigDict
from pydantic.alias_generators import to_camel

class BaseAPIModel(BaseModel):
    model_config = ConfigDict(
        alias_generator=to_camel,          # ✅автоматический alias (🐍snake_case <--> 🐫camelCase)
        validate_by_name=True,             # new - v2.11+ Позволяет передавать данные (🐍snake_case <--> 🐫camelCase)
        validate_by_alias=True             # new - v2.11+ Позволяет передавать данные (🐍snake_case <--> 🐫camelCase)
    )
   + перевезти модели из CamelCase -> snake_case (по-моему и так переведены)
------------------------------------------------------------------------------------------------------------------------
6. Пересмотреть структуру проекта Схемы в Schemas, Клиенты в Clients ...

------------------------------------------------------------------------------------------------------------------------
7. Рассмотреть вопрос отказа от валидации JSON-схемы 
потому что можно прописать в Pydantic 
model_config = ConfigDict(strict=True, extra='forbid')
тогда будут ловить ошибки валидации int=str и лишние поля

------------------------------------------------------------------------------------------------------------------------
8. 

------------------------------------------------------------------------------------------------------------------------
9. 

------------------------------------------------------------------------------------------------------------------------
10. 

------------------------------------------------------------------------------------------------------------------------
11. 

------------------------------------------------------------------------------------------------------------------------
12. 

------------------------------------------------------------------------------------------------------------------------
13. 

------------------------------------------------------------------------------------------------------------------------
14. 

------------------------------------------------------------------------------------------------------------------------

"""
