"""
pytest-rerunfailures - модуль перезапуска нестабильных (flaky) тестов
"""
"""
Terminal:
pip install pytest-rerunfailures

⚠️Синтаксис: (строгий)
<.flaky>        - маркер для перезапуска нестабильного теста
<reruns>        - параметр количества повторов перезапуска
<reruns_delay>  - задержка между повторами перезапуска
<condition>     - условие перезапуска нестабильного теста
<only_rerun>    - перезапускать только если сообщение об ошибке ... (например ="ConnectionError")
<rerun_except>  - НЕ перезапускать, если сообщение об ошибке ... (например ="ConnectionError")
"""
import pytest
import random

#============================================== Unstable test (flaky test) =============================================
#------------------------------------------------------- returns -------------------------------------------------------
# Если нестабильный тест упал - Перезапустить 5 раз,
@pytest.mark.flaky(reruns=5)
def test_1_reruns():
    assert random.choice([True, False])         # Падает 50%
                                                # ❌RERUN
                                                # ❌RERUN
                                                # ✅PASSED

#---------------------------------------------------- reruns_delay -----------------------------------------------------
# Если нестабильный тест упал - Перезапустить 5 раз, с паузой 2 сек.
@pytest.mark.flaky(reruns=5, reruns_delay=2)
def test_2_reruns_delay():
    assert random.choice([True, False])         # Падает 50%
                                                # ❌RERUN (ждёт 2 сек)
                                                # ❌RERUN (ждёт 2 сек)
                                                # ✅PASSED

#------------------------------------------------------ condition ------------------------------------------------------
# data
PING = 1.0 # sec

# Если нестабильный тест упал - перезапустить 5 раз, с паузой 2 сек —> ТОЛЬКО ЕСЛИ PING > 0.9
@pytest.mark.flaky(reruns=5, reruns_delay=2, condition=PING > 0.9)
def test_3_condition():
    assert random.choice([True, False])         # Падает 50%
                                                # ❌RERUN (ждёт 2 сек)
                                                # ❌RERUN (ждёт 2 сек)
                                                # ✅PASSED


#========================================== Unstable Test Class (flaky class) ==========================================
#------------------------------------------------------- returns -------------------------------------------------------
@pytest.mark.flaky(reruns=5)                    # 👈 всё то же самое (распространяется на ВСЕ тестовые методы тестового класса)
class TestClass:                                # Класс с нестабильными тестами
    def test_1(self):
        assert random.choice([True, False])     # Падает 50%
                                                # ❌RERUN
                                                # ✅PASSED
    def test_2(self):
        assert random.choice([True, False])     # Падает 50%
                                                # ❌RERUN
                                                # ❌RERUN
                                                # ✅PASSED

#-----------------------------------------------------------------------------------------------------------------------
