"""
pytest-rerunfailures - модуль перезапуска нестабильных (flaky) тестов
"""
import pytest
import random

"""
Terminal:
pip install pytest-rerunfailures

⚠️Синтаксис: (строгий)
<.flaky>        - маркер для перезапуска нестабильных тестов
<reruns>        - параметр количества попыток
<reruns_delay>  - задержка между попытками
"""

#================================================ Unstable test (flaky) ================================================
#-------------------------------------------- returns - количество попыток ---------------------------------------------
# 5 попыток выполнения нестабильного теста
@pytest.mark.flaky(reruns=5)
def test_1():
    assert random.choice([True, False])     # Падает 50%
                                            # ❌RERUN
                                            # ❌RERUN
                                            # ✅PASSED

#------------------------------------------- reruns_delay - задержка в сек. --------------------------------------------
# 3 попытки, с паузой 2 сек.
@pytest.mark.flaky(reruns=3, reruns_delay=2)
def test_2():
    assert random.choice([True, False])       # Падает 50%
                                              # ❌RERUN (ждёт 2 сек)
                                              # ❌RERUN (ждёт 2 сек)
                                              # ✅PASSED

#-----------------------------------------------------------------------------------------------------------------------
