"""
ids - Идентификатор (описание) для каждого параметра parametrize
"""
"""
- заменяет имя параметра на идентификатор (при выводе)
- но логика выполняется по самому значению параметра
https://docs.pytest.org/en/stable/example/parametrize.html#different-options-for-test-ids
"""
import pytest

#=======================================================================================================================
@pytest.mark.parametrize('phone_number', ['+1(111)111-0011', '+1(111)111-0022', '+1(111)111-0033'],)
def test_1(phone_number: str):       # передаем параметр (по очереди)
    ...                              # 1[+1(111)111-0011]  PASSED
                                     # 1[+1(111)111-0022]  PASSED
                                     # 1[+1(111)111-0033]  PASSE

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'phone_number', ['+1(111)111-0011', '+1(111)111-0022', '+1(111)111-0033'],
    ids=['CEO', 'Manager', 'Driver']
)
def test_2(phone_number: str):       # передаем параметр (по очереди) но выводится его id
    ...                              # [CEO]      PASSED
                                     # [Manager]  PASSED
                                     # [Driver]   PASSE


#================================================== Пример с логикой ===================================================
@pytest.mark.parametrize('number', [1, 2, 3])
def test_3(number: int):                       # передаем параметр (по очереди)
    print(f'10 + {number} = {10 + number}')    # [1]  PASSED   10 + 1 = 11
                                               # [2]  PASSED   10 + 2 = 12
                                               # [3]  PASSED   10 + 3 = 13

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'number', [1, 2, 3],
    ids=['One', 'Two', 'Three']
)
def test_4(number: int):                       # передаем параметр (по очереди), но выводится его id, а логика выполняется по самому значению параметра
    print(f'10 + {number} = {10 + number}')    # [One]   PASSED   10 + 1 = 11
                                               # [Two]   PASSED   10 + 2 = 12
                                               # [Three] PASSED   10 + 3 = 13
#=======================================================================================================================
