"""
ids - Идентификатор (описание) для каждого параметра parametrize ✨
"""

"""
- заменяет имя параметра на идентификатор (при выводе)
- но логика выполняется по самому значению параметра
https://docs.pytest.org/en/stable/example/parametrize.html#different-options-for-test-ids
"""
import pytest

#================================================= Статичные параметры =================================================
@pytest.mark.parametrize('phone_number', ['+1(111)111-0011', '+1(111)111-0022', '+1(111)111-0033'])  # 'название_параметра', ['value_1', 'value_2'...]
def test_1(phone_number: str):       # передаем параметр (со значениями по очереди)
    ...                              # 1[+1(111)111-0011]  PASSED
                                     # 1[+1(111)111-0022]  PASSED
                                     # 1[+1(111)111-0033]  PASSE

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'phone_number', ['+1(111)111-0011', '+1(111)111-0022', '+1(111)111-0033'], # 'название_параметра', ['value_1', 'value_2'...]
    ids=['CEO', 'Manager', 'Engineer']                                         # Идентификаторы (описание) для каждого параметра соответственно
)
def test_2(phone_number: str):       # передаем параметр (со значениями по очереди) но выводится его id
    ...                              # [CEO]      PASSED
                                     # [Manager]  PASSED
                                     # [Engineer] PASSE



#================================================== Пример с логикой ===================================================
@pytest.mark.parametrize('number', [1, 2, 3])  # 'название_параметра', ['value_1', 'value_2'...]
def test_3(number: int):                       # передаем параметр (с value по очереди)
    print(f'10 + {number} = {10 + number}')    # [1]  PASSED   10 + 1 = 11
                                               # [2]  PASSED   10 + 2 = 12
                                               # [3]  PASSED   10 + 3 = 13

#--------------------------------------------------------- ids ---------------------------------------------------------
@pytest.mark.parametrize(
    'number', [1, 2, 3],                       # 'название_параметра', ['value_1', 'value_2'...]
    ids=['One', 'Two', 'Three']                #  Идентификаторы (описание) для каждого параметра соответственно
)
def test_4(number: int):                       # передаем параметр (с value по очереди), но выводится его id, а логика выполняется по самому value параметра
    print(f'10 + {number} = {10 + number}')    # [One]   PASSED   10 + 1 = 11
                                               # [Two]   PASSED   10 + 2 = 12
                                               # [Three] PASSED   10 + 3 = 13


#=============================================== Динамические параметры ================================================
# Dict - словарь
company = {
    '+1(111)111-0011': 'CEO',
    '+1(111)111-0022': 'Manager',
    '+1(111)111-0033': 'Engineer'
}

#------------------------------------------ Вывод по идентификатору (простой) ------------------------------------------
@pytest.mark.parametrize(
    'phone_number', company.keys(),            # Параметр со значением из КЛЮЧЕЙ словаря
    ids=list(company.values())                 # Идентификаторы (описание) для каждого параметра - из VALUE словаря
    #ids=company.values()                      # Тоже работает (но менее корректный вариант)

)
def test_5(phone_number: str):
    ...                                        # [CEO]      PASSED
                                               # [Manager]  PASSED
                                               # [Engineer] PASSED


#------------------------------------- Вывод по СБОРНОМУ идентификатору (✨lambda) ------------------------------------- ❗НЕ ПУГАТЬСЯ❗-> см. комментарии и всё поймешь!
@pytest.mark.parametrize(
    'phone_number', company.keys(),            # Параметр со значением из КЛЮЧЕЙ словаря
    ids=lambda x: f'{x}: {company[x]}'         # Сборный идентификатор для каждого параметра - из VALUE словаря
                                               # ⮕ lambda ✨АВТОМАТОМ принимает параметр 'сверху' и: формирует через f-string сборный идентификатор
                                               # ⮕ ❗️потому что ids с функцией — это CALLBACK - т.е. функция, которую вы передаёте другой функции, чтобы та вызвала её сама в нужный момент)
)
def test_6(phone_number: str):
    ...                                        # [+1(111)111-0011: CEO]      PASSED
                                               # [+1(111)111-0022: Manager]  PASSED
                                               # [+1(111)111-0033: Engineer] PASSED

#=======================================================================================================================
