"""
Allure Steps

- Контекст-менеджер <with>  — Для описания НЕСКОЛЬКО шагов в функции
- Декоратор @allure.step()  — Для описания ОДНОГО/ОБЩЕГО шага
— @allure.step() + <with>     — Для описания ОБЩЕГО шага функции + ВНУТРЕННИЕ шаги (sub-steps)
"""
import allure

#=============================================== Контекст-менеджер <with> ==============================================

#-----------------------------------------------------------------------------------------------------------------------
# Test с НЕСКОЛЬКИМИ шагами
def test_step_in_test_with():
    with allure.step('Create User'):        # Описание шага 1 теста (через контекст-менеджер <with>)
        ...                                 # ▶ Actions
    with allure.step('Delete User'):        # Описание шага 2 теста (через контекст-менеджер <with>)
        ...                                 # ▶ Actions


#-----------------------------------------------------------------------------------------------------------------------
# Функция с ОДНИМ шагом
def get_user_1():                           # Функция-1
    with allure.step('Get User-1'):         # Описание шага Функции-1 (через контекст-менеджер <with>)
        ...                                 # ▶ Actions

# Функция с ОДНИМ шагом
def update_user_1():                        # Функция-2
    with allure.step('Update User-1'):      # Описание шага Функции-2 (через контекст-менеджер <with>)
        ...                                 # ▶ Actions

#---------------------------
# Test
def test_step_in_func_with():
    get_user_1()                            # Вызываем Функцию-1 (со встроенным описанием шагов)
    update_user_1()                         # Вызываем Функцию-2 (со встроенным описанием шагов)




#============================================== Декоратор @allure.step() ===============================================

# Функция с ОДНИМ шагом
@allure.step('Get User-2')                  # Описание шага Функции-1 (через @декоратор)
def get_user_2():                           # Функция 1
    ...                                     # ▶ Actions

# Функция с ОДНИМ шагом + ПАРАМЕТР
new_name = 'John Connor'                    # Переменная (параметр)

@allure.step(f'Update User-2: {new_name}')  # Описание шага Функции-1 (через @декоратор) + параметр
def update_user_2():                        # Функция 2
    ...                                     # ▶ Actions

#--------------------------------
# Test
def test_step_in_func_decorator():
    get_user_2()                            # Вызываем Функцию-1 (со встроенным описанием шагов)
    update_user_2()                         # Вызываем Функцию-2 (со встроенным описанием шагов)


#=============================================== @allure.step() + with =================================================

# Функция c ВНУТРЕННИМИ шагами (sub-steps)
@allure.step(f'Build API-Client')               # Описание ОБЩЕГО шага функции (через @декоратор)
def build_api_client():
    with allure.step('Get Auth-token'):         # Описание 1-го внутреннего шага функции (через with)
        ...                                     # ▶ Actions
    with allure.step('Create new API-client'):  # Описание 2-го внутреннего шага функции (через with)
        ...                                     # ▶ Actions

#-----====----------------------
# Test
def test_create_file_sub_steps():
    build_api_client()                          # Вызываем Функцию (со встроенным описанием шагов)

#=======================================================================================================================
