"""
Allure Steps

- Через контекст-менеджер <with>  — используется если в функции НЕСКОЛЬКО шагов или для добавления ДИНАМИЧЕСКОГО описания шага
- Через @декоратор                — используется для описания ОДНОСЛОЖНОГО действия шага
"""
import allure

#============================================ Через контекст-менеджер <with> ===========================================


#------------------------------------------ v.1 Описание каждого шага теста --------------------------------------------
# Test
def test_step_in_test_with():
    with allure.step('Create User'):      # Описание шага 1 теста (через контекст-менеджер <with>)
        ...                               # ▶ Actions
    with allure.step('Delete User'):      # Описание шага 2 теста (через контекст-менеджер <with>)
        ...                               # ▶ Actions


#--------------------------------------------- v.2 Описание шага в функции ---------------------------------------------
# Отдельные функции
def get_user():                           # Функция-1
    with allure.step('Get User'):         # Описание шага Функции-1 (через контекст-менеджер <with>)
        ...                               # ▶ Actions

def update_user():                        # Функция-2
    with allure.step('Update User'):      # Описание шага Функции-2 (через контекст-менеджер <with>)
        ...                               # ▶ Actions


# Test
def test_step_in_func_with():
    get_user()                            # Вызываем Функцию-1
    update_user()                         # Вызываем Функцию-2
    ...


#================================================== Через @декоратор ===================================================
# @декоратор используется для описания ОДНОСЛОЖНОГО действия функции

# Отдельные функции
@allure.step('Get User')                  # Описание шага Функции-1 (через @декоратор)
def get_user():                           # Функция 1
        ...                               # ▶ Actions

@allure.step('Update User')               # Описание шага Функции-2 (через @декоратор)
def update_user():                        # Функция 2
        ...                               # ▶ Actions


# Test
def test_step_in_func_decorator():
    get_user()                            # Вызываем Функцию-1 (со встроенным описанием шага)
    update_user()                         # Вызываем Функцию-2 (со встроенным описанием шага)
    ...

#=======================================================================================================================
