"""
Кэширование (lru_cache)
"""
"""
Позволяет не выполнять функцию, если она уже была вызвана С ТЕМИ ЖЕ АРГУМЕНТАМИ
⚠️ - требуется frozen=True для Schema
"""
from functools import lru_cache

#=======================================================================================================================
#------------------------------------------------- Классический --------------------------------------------------------
def plus(a, b):
    print(f'a: {a}, b: {b}')
    return a + b

# Вызов
plus(1, 2)   # a: 1, b: 2   - вызов функции с аргументами
plus(1, 2)   # a: 1, b: 2   - повторный вызов С ТЕМИ ЖЕ аргументами

plus(2, 2)   # a: 2, b: 2   - вызов функции с аргументами
plus(2, 2)   # a: 2, b: 2   - повторный вызов С ТЕМИ ЖЕ аргументами


#-------------------------------------------------- Кэширование --------------------------------------------------------
@lru_cache() # кэшируем
def plus(a, b):
    print(f'a: {a}, b: {b}')
    return a + b

# Вызов
plus(1, 2)   # a: 1, b: 2   - вызов функции с аргументами
plus(1, 2)   #              - ✨ПРОПУСК (т.к. те же аргументы)

plus(2, 2)   # a: 2, b: 2   - вызов функции с аргументами
plus(2, 2)   #              - ✨ПРОПУСК (т.к. те же аргументы)

#=======================================================================================================================
