"""
Pytest marker <skip>
Пропуск теста
"""
"""
Пропуск теста, например фичи, которая еще находится в разработке, но тест уже написан
"""
import pytest
#=======================================================================================================================
@pytest.mark.skip                                # Пропуск теста (причина по умолчанию)
def test_1():                                    # SKIPPED (unconditional skip)
    assert 1 + 1 == 2


@pytest.mark.skip(reason='Фича в разработке')    # Пропуск теста (c указанием причины)
def test_2():                                    # SKIPPED (Фича в разработке)
    assert 1 + 1 == 2

#-----------------------------------------------------------------------------------------------------------------------
