"""
Files Pydantic Schemas
"""
from pydantic import BaseModel

#=================================================== REQUEST schema ====================================================
#---------------------------------------------------- Create File ------------------------------------------------------
class CreateFileRequestSchema(BaseModel):
    """
    Схема payload для запроса на создание файла.
    """
    filename: str       # Имя файла
    directory: str      # Имя директории сохранения
    upload_path: str    # Путь к файлу


#=================================================== RESPONSE schema ===================================================
#---------------------------------------------------- Create File ------------------------------------------------------
class FileSchema(BaseModel):
    """
    Схема ключа "file": {}
    """
    id: str             # File ID
    filename: str       # Новое имя файла после сохранения на сервере
    directory: str      # Имя директории сохранения
    url: str            # URL-адрес файла

class CreateFileResponseSchema(BaseModel):
    """
    Схема ответа при создании файла.
    """
    file: FileSchema
#-----------------------------------------------------------------------------------------------------------------------
