"""
Data Generator
"""
from faker import Faker

#=======================================================================================================================
class Fake:
    """
    Класс для генерации случайных тестовых данных с использованием библиотеки Faker
    """
    def __init__(self, faker: Faker):
        """
        Инициализация

        :param faker: Экземпляр класса Faker(), который будет использоваться для генерации данных.
        """
        self.faker = faker

    #------------------------------------------------ User Credentials -------------------------------------------------
    def first_name(self) -> str:
        """
        Генерация First Name

        :return: John
        """
        return self.faker.first_name()
    #-------------------------------------------------------------------------------------------------------------------
    def middle_name(self) -> str:
        """
        Генерация Middle Name

        :return: Connor
        """
        return self.faker.first_name()
    #-------------------------------------------------------------------------------------------------------------------
    def last_name(self) -> str:
        """
        Генерация Last Name

        :return: Connor
        """
        return self.faker.last_name()
    #-------------------------------------------------------------------------------------------------------------------
    def email(self) -> str:
        """
        Генерация email

        :return: example@email.com
        """
        return self.faker.email(domain='email.com')
    #-------------------------------------------------------------------------------------------------------------------
    def password(self) -> str:
        """
        Генерация пароля

        :return: Password
        """
        return self.faker.password()

    #-------------------------------------------------------- ID -------------------------------------------------------
    def user_id(self) -> str:
        """
        Генерация бизнес-формата User ID

        :return: USER-12345
        """
        number = self.faker.random_int(10000, 99999)
        return f'USER-{number}'
    #-------------------------------------------------------------------------------------------------------------------
    def uuid4(self) -> str:
        """
        Генерация UUID

        :return: <cad77163-f85d-4b96-b807-27670ffc9c29>
        """
        return self.faker.uuid4()

    #------------------------------------------------------- Text ------------------------------------------------------
    def text(self, max_nb_chars: int = 100) -> str:
        """
        Генерация текста с заданной максимальной длиной.

        :param max_nb_chars: Максимальная длина (в символах). Default = 100
        :return: Случайные предложения
        """
        return self.faker.text(max_nb_chars=max_nb_chars)

    #------------------------------------------------------- Other -----------------------------------------------------
    def estimated_time(self, minimum: int = 2, maximum: int = 9) -> str:
        """
        Генерация оценочного времени в неделях. Default = [2-9]
        :param minimum: Начало диапазона (Default = 2)
        :param maximum: Конец диапазона (Default = 9)
        :return: [2-9] weeks
        """
        quantity = self.faker.random_int(minimum, maximum)
        return f'{quantity} weeks'
    #-------------------------------------------------------------------------------------------------------------------
    def max_core(self) -> int:
        """
        Генерация максимального бала в диапазоне [50-100]

        :return: Максимальный бал [50-100]
        """
        return self.faker.random_int(50, 100)
    #-------------------------------------------------------------------------------------------------------------------
    def min_score(self) -> int:
        """
        Генерация минимального бала в диапазоне [1-30]

        :return: Минимальный бал [1-30]
        """
        return self.faker.random_int(1, 30)
    #-------------------------------------------------------------------------------------------------------------------


#====================================== Инициализация экземпляра класса (для import) ===================================
fake = Fake(faker=Faker())                     # en_US - Default
fake_ru = Fake(faker=Faker(locale='ru_RU'))    # ru_RU

#=======================================================================================================================
