"""
Data Generator
"""
from faker import Faker

#=======================================================================================================================
class Fake:
    """
    Класс для генерации случайных тестовых данных с использованием библиотеки Faker
    """
    def __init__(self, faker: Faker):
        """
        Инициализация

        :param faker: Экземпляр класса Faker(), который будет использоваться для генерации данных.
        """
        self.faker = faker

    #------------------------------------------------ User Credentials -------------------------------------------------
    def first_name(self) -> str:
        """
        Генерация First Name

        :return: John
        """
        return self.faker.first_name()
    #-------------------------------------------------------------------------------------------------------------------
    def middle_name(self) -> str:
        """
        Генерация Middle Name

        :return: Connor
        """
        return self.faker.first_name()
    #-------------------------------------------------------------------------------------------------------------------
    def last_name(self) -> str:
        """
        Генерация Last Name

        :return: Connor
        """
        return self.faker.last_name()
    #-------------------------------------------------------------------------------------------------------------------
    def email(self) -> str:
        """
        Генерация email

        :return: example@email.com
        """
        return self.faker.email(domain='email.com')
    #-------------------------------------------------------------------------------------------------------------------
    def password(self) -> str:
        """
        Генерация пароля

        :return: Password
        """
        return self.faker.password()

    #-------------------------------------------------------- ID -------------------------------------------------------
    def user_id(self) -> str:
        """
        Генерация бизнес-формата User ID

        :return: Строка формата: User-1234
        """
        number = self.faker.random_int()
        return f'User-{number}'
    #-------------------------------------------------------------------------------------------------------------------
    def uuid4(self) -> str:
        """
        Генерация UUID

        :return: Строка формата: cad77163-f85d-4b96-b807-27670ffc9c29
        """
        return self.faker.uuid4()

    #------------------------------------------------------- Text ------------------------------------------------------
    def sentence(self, nb_words: int = 5):
        """
        Генерация предложения из 5 слов

        :return: Предложение из 5 слов (default)
        """
        return self.faker.sentence(nb_words=nb_words)
    #-------------------------------------------------------------------------------------------------------------------
    def text(self, max_nb_chars: int = 50) -> str:
        """
        Генерация текста с заданной максимальной длиной

        :param max_nb_chars: Количество символов. Default = 50
        :return: Случайные предложения
        """
        return self.faker.text(max_nb_chars=max_nb_chars)

    #------------------------------------------------------ Other ------------------------------------------------------
    def estimated_time(self, minimum: int = 2, maximum: int = 9) -> str:
        """
        Генерация оценочного времени в неделях. Default = [2-9]
        :param minimum: Начало диапазона (Default = 2)
        :param maximum: Конец диапазона (Default = 9)
        :return: [2-9] weeks
        """
        number = self.faker.random_int(minimum, maximum)
        return f'{number} weeks'

    #------------------------------------------------------ Score ------------------------------------------------------
    def max_score(self) -> int:
        """
        Генерация максимального бала в диапазоне [50-100]

        :return: Максимальный бал [50-100]
        """
        return self.faker.random_int(50, 100)
    #-------------------------------------------------------------------------------------------------------------------
    def min_score(self) -> int:
        """
        Генерация минимального бала в диапазоне [1-30]

        :return: Минимальный бал [1-30]
        """
        return self.faker.random_int(1, 30)

    #------------------------------------------------------- Files -----------------------------------------------------
    def png_file_name(self) -> str:
        """
        Генерация имени файла .png при сохранении на сервере (Upload)

        :return: Срока формата file_1234.png
        """
        number = self.faker.random_int()
        return f'file_{number}.png'


#====================================== Инициализация экземпляра класса (❗️для import) ===================================
fake = Fake(faker=Faker())                     # en_US - Default
fake_ru = Fake(faker=Faker(locale='ru_RU'))    # ru_RU

#=======================================================================================================================
